In [2]:
import pandas as pd
import numpy as np

DATA DESCRIPTION
```
file name -> Columns
quater-i.csv -> ['order_id', 'quantity', 'item_id', 'choice_description_id' 'item_price']
items.csv -> ['item_id', 'item_name']
```
Dataset Link - https://drive.google.com/drive/folders/1Z0kaFybvgFeczeUj4dldUnhTdloLqLsL?usp=share_link

In [45]:
# import like this
items_path = "datasets20/items.csv"
q1_path = "datasets20/quarter-1.csv"
q2_path = "datasets20/quarter-2.csv"
q3_path = "datasets20/quarter-3.csv"


q1= pd.read_csv(q1_path)
q2 = pd.read_csv(q2_path)
q3 = pd.read_csv(q3_path)

items = pd.read_csv(items_path)

In [31]:
items.head(2)

   item_id                     item_name
0        0  Chips and Fresh Tomato Salsa
1        1                          Izze

###`Q:1-5`
1. You are given three quater files, your job is to append these three files and make a single dataframe.
2. Have a index as Q-1 Q-2 Q-3 for respective quater files in the dataframe
3. Your are given a file items.csv which has item_id and item_name. Find out most sold items in each quarter.
4. Find out items which has made most revenue in each quarter.
5. Find out avg order price of each quarter.

***Note: item_price is given as str with $ sign, in earlier task you have converted this to rupees, here too first convert item_price field in rupees.***

In [33]:
# code here
# You are given three quater files, your job is to append these three files and make a single dataframe. 

q3 = pd.concat([q1,q2], ignore_index=True)

In [35]:
q3.head()

   order_id  quantity  item_id  choice_description_id item_price
0         1         1        1                      1     $3.39
1         1         1        2                      2     $3.39
2         2         2        4                      3    $16.98
3         4         1        7                      6     $9.25
4         6         1        9                      8     $8.75

In [37]:
# Have a index as Q-1 Q-2 Q-3 for respective quater files in the dataframe 
# Your are given a file items.csv which has item_id and item_name. Find out most sold items in each quarter.
q3.merge(items, on="item_id")["item_name"].value_counts().reset_index(name="Counts").head(5)

             item_name  Counts
0         Chicken Bowl     726
1      Chicken Burrito     553
2  Chips and Guacamole     479
3        Steak Burrito     368
4    Canned Soft Drink     301

In [ ]:
# Find out items which has made most revenue in each quarter.

In [47]:
q1["item_price"] = q1["item_price"].str.replace("$","").astype("float")*84

In [49]:
q1.head()

   order_id  quantity  item_id  choice_description_id  item_price
0         1         1        1                      1      284.76
1         1         1        2                      2      284.76
2         2         2        4                      3     1426.32
3         4         1        7                      6      777.00
4         6         1        9                      8      735.00

In [53]:
q1["total_price"]=q1["item_price"]*q1['quantity']
q1.head()

   order_id  quantity  item_id  choice_description_id  item_price  total_price
0         1         1        1                      1      284.76       284.76
1         1         1        2                      2      284.76       284.76
2         2         2        4                      3     1426.32      2852.64
3         4         1        7                      6      777.00       777.00
4         6         1        9                      8      735.00       735.00

In [55]:
df = q1.merge(items, on="item_id")
df.head()

,order_id,quantity,item_id,choice_description_id,item_price,total_price,item_name
0,1,1,1,1,284.76,284.76,Izze
1,1,1,2,2,284.76,284.76,Nantucket Nectar
2,2,2,4,3,1426.32,2852.64,Chicken Bowl
3,4,1,7,6,777.00,777.00,Steak Soft Tacos
4,6,1,9,8,735.00,735.00,Chicken Crispy Tacos

In [63]:
df.groupby("item_name")["total_price"].sum().sort_values(ascending = False)

item_name
Chicken Bowl                             323599.92
Chicken Burrito                          262828.44
Steak Burrito                            173303.76
Chips and Guacamole                      106833.72
Steak Bowl                               106059.24
Chicken Salad Bowl                        72975.00
Chips and Fresh Tomato Salsa              70199.64
Carnitas Bowl                             46128.60
Chicken Soft Tacos                        46059.72
Veggie Burrito                            41871.48
Barbacoa Burrito                          39721.92
Veggie Bowl                               36127.56
Bottled Water                             31876.32
Barbacoa Bowl                             29972.88
Carnitas Burrito                          28933.80
Chicken Crispy Tacos                      24355.80
Chips                                     23297.40
Canned Soft Drink                         21315.00
Steak Crispy Tacos                        20695.08
Steak Soft Tacos                          18915.12
Carnitas Soft Tacos                       18203.64
6 Pack Soft Drink                         17990.28
Steak Salad Bowl                          17926.44
Barbacoa Soft Tacos                        8378.16
Canned Soda                                7965.72
Side of Chips                              7381.92
Veggie Salad Bowl                          6720.00
Barbacoa Crispy Tacos                      6359.64
Nantucket Nectar                           5979.96
Chips and Tomatillo Green Chili Salsa      5947.20
Bowl                                       5594.40
Chips and Tomatillo Red Chili Salsa        5203.80
Carnitas Crispy Tacos                      4784.64
Barbacoa Salad Bowl                        4573.80
Chips and Roasted Chili Corn Salsa         3469.20
Chips and Tomatillo-Red Chili Salsa        3212.16
Izze                                       3132.36
Chicken Salad                              3036.60
Chips and Tomatillo-Green Chili Salsa      2810.64
Carnitas Salad Bowl                        1997.52
Burrito                                    1864.80
Steak Salad                                1510.32
Veggie Soft Tacos                          1470.00
Chips and Roasted Chili-Corn Salsa         1405.32
Salad                                      1243.20
Crispy Tacos                               1243.20
Carnitas Salad                              755.16
Veggie Salad                                713.16
Chips and Mild Fresh Tomato Salsa           252.00
Name: total_price, dtype: float64

# ipl data loding

In [12]:
ball = pd.read_csv("datasets20/IPL_Ball_by_Ball_2008_2022.csv")
match = pd.read_csv("datasets20/IPL_Matches_2008_2022.csv")
delivery = pd.read_csv("datasets20/ipl_deliveries.csv")
delivery.head()

,ID,Team,innings,overs,ballnumber,batter,bowler,non-striker,extra_type,batsman_run,extras_run,total_run,non_boundary,isWicketDelivery,player_out,kind,fielders_involved,BattingTeam,BowlingTeam
0,1312200,Rajasthan RoyalsGujarat Titans,1,0,1,YBK Jaiswal,Mohammed Shami,JC Buttler,NaN,0,0,0,0,0,NaN,NaN,NaN,Rajasthan Royals,Gujarat Titans
1,1312200,Rajasthan RoyalsGujarat Titans,1,0,2,YBK Jaiswal,Mohammed Shami,JC Buttler,legbyes,0,1,1,0,0,NaN,NaN,NaN,Rajasthan Royals,Gujarat Titans
2,1312200,Rajasthan RoyalsGujarat Titans,1,0,3,JC Buttler,Mohammed Shami,YBK Jaiswal,NaN,1,0,1,0,0,NaN,NaN,NaN,Rajasthan Royals,Gujarat Titans
3,1312200,Rajasthan RoyalsGujarat Titans,1,0,4,YBK Jaiswal,Mohammed Shami,JC Buttler,NaN,0,0,0,0,0,NaN,NaN,NaN,Rajasthan Royals,Gujarat Titans
4,1312200,Rajasthan RoyalsGujarat Titans,1,0,5,YBK Jaiswal,Mohammed Shami,JC Buttler,NaN,0,0,0,0,0,NaN,NaN,NaN,Rajasthan Royals,Gujarat Titans

In [149]:
delivery.extra_type.unique()

array([nan, 'legbyes', 'wides', 'byes', 'noballs', 'penalty'],
      dtype=object)

In [6]:
match.head(3)

,ID,City,Date,Season,MatchNumber,Team1,Team2,Venue,TossWinner,TossDecision,SuperOver,WinningTeam,WonBy,Margin,method,Player_of_Match,Team1Players,Team2Players,Umpire1,Umpire2
0,1312200,Ahmedabad,2022-05-29,2022,Final,Rajasthan Royals,Gujarat Titans,"Narendra Modi Stadium, Ahmedabad",Rajasthan Royals,bat,N,Gujarat Titans,Wickets,7.0,NaN,HH Pandya,"['YBK Jaiswal', 'JC Buttler', 'SV Samson', 'D ...","['WP Saha', 'Shubman Gill', 'MS Wade', 'HH Pan...",CB Gaffaney,Nitin Menon
1,1312199,Ahmedabad,2022-05-27,2022,Qualifier 2,Royal Challengers Bangalore,Rajasthan Royals,"Narendra Modi Stadium, Ahmedabad",Rajasthan Royals,field,N,Rajasthan Royals,Wickets,7.0,NaN,JC Buttler,"['V Kohli', 'F du Plessis', 'RM Patidar', 'GJ ...","['YBK Jaiswal', 'JC Buttler', 'SV Samson', 'D ...",CB Gaffaney,Nitin Menon
2,1312198,Kolkata,2022-05-25,2022,Eliminator,Royal Challengers Bangalore,Lucknow Super Giants,"Eden Gardens, Kolkata",Lucknow Super Giants,field,N,Royal Challengers Bangalore,Runs,14.0,NaN,RM Patidar,"['V Kohli', 'F du Plessis', 'RM Patidar', 'GJ ...","['Q de Kock', 'KL Rahul', 'M Vohra', 'DJ Hooda...",J Madanagopal,MA Gough

In [36]:
df = match.loc[:,["ID","Season"]].merge(delivery, on= "ID")
df.head(3)

,ID,Season,Team,innings,overs,ballnumber,batter,bowler,non-striker,extra_type,batsman_run,extras_run,total_run,non_boundary,isWicketDelivery,player_out,kind,fielders_involved,BattingTeam,BowlingTeam
0,1312200,2022,Rajasthan RoyalsGujarat Titans,1,0,1,YBK Jaiswal,Mohammed Shami,JC Buttler,NaN,0,0,0,0,0,NaN,NaN,NaN,Rajasthan Royals,Gujarat Titans
1,1312200,2022,Rajasthan RoyalsGujarat Titans,1,0,2,YBK Jaiswal,Mohammed Shami,JC Buttler,legbyes,0,1,1,0,0,NaN,NaN,NaN,Rajasthan Royals,Gujarat Titans
2,1312200,2022,Rajasthan RoyalsGujarat Titans,1,0,3,JC Buttler,Mohammed Shami,YBK Jaiswal,NaN,1,0,1,0,0,NaN,NaN,NaN,Rajasthan Royals,Gujarat Titans

In [8]:
delivery.head()

,ID,Team,innings,overs,ballnumber,batter,bowler,non-striker,extra_type,batsman_run,extras_run,total_run,non_boundary,isWicketDelivery,player_out,kind,fielders_involved,BattingTeam,BowlingTeam
0,1312200,Rajasthan RoyalsGujarat Titans,1,0,1,YBK Jaiswal,Mohammed Shami,JC Buttler,NaN,0,0,0,0,0,NaN,NaN,NaN,Rajasthan Royals,Gujarat Titans
1,1312200,Rajasthan RoyalsGujarat Titans,1,0,2,YBK Jaiswal,Mohammed Shami,JC Buttler,legbyes,0,1,1,0,0,NaN,NaN,NaN,Rajasthan Royals,Gujarat Titans
2,1312200,Rajasthan RoyalsGujarat Titans,1,0,3,JC Buttler,Mohammed Shami,YBK Jaiswal,NaN,1,0,1,0,0,NaN,NaN,NaN,Rajasthan Royals,Gujarat Titans
3,1312200,Rajasthan RoyalsGujarat Titans,1,0,4,YBK Jaiswal,Mohammed Shami,JC Buttler,NaN,0,0,0,0,0,NaN,NaN,NaN,Rajasthan Royals,Gujarat Titans
4,1312200,Rajasthan RoyalsGujarat Titans,1,0,5,YBK Jaiswal,Mohammed Shami,JC Buttler,NaN,0,0,0,0,0,NaN,NaN,NaN,Rajasthan Royals,Gujarat Titans

In [64]:
purpal = df[df["isWicketDelivery"]==1].groupby(["Season","bowler"])["bowler"].count().sort_values(ascending = False).reset_index(name="Purpal_cap")
purpal.groupby("Season").first()

                bowler  Purpal_cap
Season
2007/08  Sohail Tanvir          24
2009          RP Singh          26
2009/10        PP Ojha          22
2011        SL Malinga          30
2012          M Morkel          30
2013          DJ Bravo          34
2014         MM Sharma          26
2015          DJ Bravo          28
2016           B Kumar          24
2017           B Kumar          28
2018            AJ Tye          28
2019          K Rabada          29
2020/21       K Rabada          32
2021          HV Patel          35
2022         YS Chahal          29

###`Q-6` From the IPL wala dataset you have to find the Purple cap holder each season.

*Note: Bowler with most no wickets in a season gets purple cap. If more than one bowler have same no of wickets in the season, one with least ecomnomy among them is purple cap holder.*

Bowler's Economy = runs-conceded per six balls

In [ ]:
# code here

###`Q-7:` Best bowler in death overs.
*Note: Have taken most no of wickets in case of tie with least economy*

Death Overs - [16-20]

In [98]:
# code here
death = delivery[(delivery["overs"]>15)]
total_runs = death.groupby("bowler")["total_run"].sum()
count =  death['bowler'].value_counts()
total_wik = death.groupby("bowler")["isWicketDelivery"].sum()
death_over = pd.DataFrame({"count":count,"total_runs":total_runs,"total_wik":total_wik,"strike_rate":np.round((total_runs/count)*100)})

In [104]:
death_over.sort_values(by=["total_wik","strike_rate"],ascending=False).head()

            count  total_runs  total_wik  strike_rate
bowler
DJ Bravo     1179        1842        115        156.0
SL Malinga    965        1252        104        130.0
B Kumar      1048        1575         82        150.0
JJ Bumrah    1072        1508         79        141.0
SP Narine     717         942         64        131.0

###`Q-8` Batsman record season wise

Make a function which takes a input `batsman_name` and it returns a dataframe.
Columns of the data frame are - `['Season','Innings', 'TotalRuns', 'Avg', 'HighestScore','StrikeRate']`.
* In result make `Season` column as index.

* Avg - total_runs/ no of time got out. - player_out column will help.
* StrikeRate -(total_runs/ balls faced) * 100- wides are not included in batsman ball faced counts. No balls are included. -> Extra_type column will help
* Batsman Can score runs on No Balls.
* Batsman can get out on No Ball or Wides. And even while being on non-striker. Keep these things in mind before masking.

In [163]:
# code here
ipl = delivery.merge(match,on="ID").loc[:,["batter","Season","innings","total_run","player_out","extra_type"]]
ipl.head()

        batter Season  innings  total_run player_out extra_type
0  YBK Jaiswal   2022        1          0        NaN        NaN
1  YBK Jaiswal   2022        1          1        NaN    legbyes
2   JC Buttler   2022        1          1        NaN        NaN
3  YBK Jaiswal   2022        1          0        NaN        NaN
4  YBK Jaiswal   2022        1          0        NaN        NaN

In [191]:
player = "V Kohli"
batsman = ipl[ipl["batter"]==player]
total_runs = batsman.groupby(["Season"])["total_run"].sum()
count = batsman.groupby(["Season"])["total_run"].count()
out = batsman[batsman["player_out"]==player].groupby(["Season"])["player_out"].count()
wides_count = batsman[batsman["extra_type"]=="wides"].groupby(["Season"])["player_out"].count()
max_score = batsman.groupby(["Season"])["total_run"].max()

batter = pd.DataFrame({"AVG":(total_runs/out),"HighestScore":max_score,"StrikeRate":(total_runs/(count-wides_count))*100})

batter

               AVG  HighestScore  StrikeRate
Season
2007/08  17.000000             6  111.309524
2009     23.454545             6  114.666667
2009/10  29.090909             6  148.148148
2011     48.666667             6  123.467230
2012     31.250000             6  112.612613
2013     47.142857             6  140.127389
2014     28.692308             6  123.920266
2015     47.181818             6  131.392405
2016     83.166667             7  152.366412
2017     31.400000             6  122.178988
2018     49.000000             6  140.000000
2019     33.714286             6  142.168675
2020/21  44.727273             6  122.388060
2021     30.214286             6  121.902017
2022     25.857143             6  118.300654

In [137]:
batsman["AVG"] = sum(batsman['total_run'])/batsman['batter'].count()

410

###`Q-9` Using both dataset, make a dataframe as described below

Data Frame columns-> `['PlayerOfThematch', 'BattingFigure', 'BowlingFigure']`

* BattingFigure->`<runs>/<balls>`
* BowlingFigure->`<wicket>/<runs-conceded>`

DataFrame should have one record for each match.

Say 'V Kohli' got POM award then in dataset include his batting figure of that match. Say he scored 112runs in 76 balls. And he hasn't bowled so Bowling Figure will be NaN
```
PlayerOfThematch BattingFigure BowlingFigure
V Kohli          112/76         nan  

```

In [72]:
# code here
pom=delivery.merge(match,on="ID").loc[:,["Player_of_Match","batter","bowler","batsman_run","total_run","isWicketDelivery"]]
pom_batting = pom[pom['batter']==pom["Player_of_Match"]]
pom_bowling = pom[pom['bowler']==pom["Player_of_Match"]]
pom_bowling.head()

,Player_of_Match,batter,bowler,batsman_run,total_run,isWicketDelivery
48,HH Pandya,JC Buttler,HH Pandya,1,1,0
49,HH Pandya,SV Samson,HH Pandya,0,0,1
50,HH Pandya,D Padikkal,HH Pandya,0,0,0
51,HH Pandya,D Padikkal,HH Pandya,0,0,0
52,HH Pandya,D Padikkal,HH Pandya,0,0,0

In [ ]:
runs_conceded=pom.groupby('Player_of_Match')['batsman_run'].sum()
balls=pom.groupby('Player_of_Match')['ballnumber'].count()
wicket=pom.groupby('Player_of_Match')['isWicketDelivery'].sum()
df=pd.DataFrame({'BattingFigure':runs.astype('str')+'/'+balls.astype('str'),'BowlingFigure':wicket.astype(str)+'/'+runs_conceded.astype(str)})
df["V Kohli"]

In [82]:
# batsman
bat_total_run = pom_batting.groupby("Player_of_Match")["batsman_run"].sum()
bat_count = pom_batting["Player_of_Match"].value_counts()
# pom_bat = pd.DataFrame(
#     {
#         "bat_total_run":bat_total_run,
#         "bat_count":bat_count}
# )
# bat_count

In [84]:
# bowling 
ball_total_run = pom_bowling.groupby("Player_of_Match")["total_run"].sum()
total_wik = pom_bowling.groupby("Player_of_Match")["isWicketDelivery"].sum()

In [86]:
final_pom = pd.DataFrame(
    {
        "bat_total_run":bat_total_run,
        "bat_count":bat_count,
        "ball_total_run":ball_total_run,
        "total_wik":total_wik
    }
)
final_pom.head()

                 bat_total_run  bat_count  ball_total_run  total_wik
Player_of_Match
A Chandila                 NaN        NaN            13.0        4.0
A Kumble                   3.0        2.0            49.0       11.0
A Mishra                  64.0       47.0           213.0       36.0
A Nehra                    NaN        NaN           131.0       18.0
A Nortje                   NaN        NaN            85.0        8.0

In [108]:
df=pd.DataFrame({'BattingFigure':bat_total_run.astype('str')+'/'+bat_count.astype('str'),'BowlingFigure':total_wik.astype(str)+'/'+ball_total_run.astype(str)})
df

                BattingFigure BowlingFigure
Player_of_Match
A Chandila                NaN          4/13
A Kumble                  3/2         11/49
A Mishra                64/47        36/213
A Nehra                   NaN        18/131
A Nortje                  NaN          8/85
...                       ...           ...
YBK Jaiswal             68/42           NaN
YK Pathan             878/461        10/219
YS Chahal                 NaN        18/165
Yuvraj Singh          266/149         10/92
Z Khan                    NaN          2/10

[262 rows x 2 columns]

In [112]:
match.head()

,ID,City,Date,Season,MatchNumber,Team1,Team2,Venue,TossWinner,TossDecision,SuperOver,WinningTeam,WonBy,Margin,method,Player_of_Match,Team1Players,Team2Players,Umpire1,Umpire2
0,1312200,Ahmedabad,2022-05-29,2022,Final,Rajasthan Royals,Gujarat Titans,"Narendra Modi Stadium, Ahmedabad",Rajasthan Royals,bat,N,Gujarat Titans,Wickets,7.0,NaN,HH Pandya,"['YBK Jaiswal', 'JC Buttler', 'SV Samson', 'D ...","['WP Saha', 'Shubman Gill', 'MS Wade', 'HH Pan...",CB Gaffaney,Nitin Menon
1,1312199,Ahmedabad,2022-05-27,2022,Qualifier 2,Royal Challengers Bangalore,Rajasthan Royals,"Narendra Modi Stadium, Ahmedabad",Rajasthan Royals,field,N,Rajasthan Royals,Wickets,7.0,NaN,JC Buttler,"['V Kohli', 'F du Plessis', 'RM Patidar', 'GJ ...","['YBK Jaiswal', 'JC Buttler', 'SV Samson', 'D ...",CB Gaffaney,Nitin Menon
2,1312198,Kolkata,2022-05-25,2022,Eliminator,Royal Challengers Bangalore,Lucknow Super Giants,"Eden Gardens, Kolkata",Lucknow Super Giants,field,N,Royal Challengers Bangalore,Runs,14.0,NaN,RM Patidar,"['V Kohli', 'F du Plessis', 'RM Patidar', 'GJ ...","['Q de Kock', 'KL Rahul', 'M Vohra', 'DJ Hooda...",J Madanagopal,MA Gough
3,1312197,Kolkata,2022-05-24,2022,Qualifier 1,Rajasthan Royals,Gujarat Titans,"Eden Gardens, Kolkata",Gujarat Titans,field,N,Gujarat Titans,Wickets,7.0,NaN,DA Miller,"['YBK Jaiswal', 'JC Buttler', 'SV Samson', 'D ...","['WP Saha', 'Shubman Gill', 'MS Wade', 'HH Pan...",BNJ Oxenford,VK Sharma
4,1304116,Mumbai,2022-05-22,2022,70,Sunrisers Hyderabad,Punjab Kings,"Wankhede Stadium, Mumbai",Sunrisers Hyderabad,bat,N,Punjab Kings,Wickets,5.0,NaN,Harpreet Brar,"['PK Garg', 'Abhishek Sharma', 'RA Tripathi', ...","['JM Bairstow', 'S Dhawan', 'M Shahrukh Khan',...",AK Chaudhary,NA Patwardhan

In [117]:
df.loc["V Kohli"]

BattingFigure    1094/673
BowlingFigure         NaN
Name: V Kohli, dtype: object

## **Questions Based on Iris Dataset**

- **Sepal All:** https://docs.google.com/spreadsheets/d/e/2PACX-1vT58ekmHTwptX7Bs4QOy6YByA1HMvYTACeeIjrKhHE0Pg1K_3egewHMKMh02zN9D5-yHVXfvuaa3s5u/pub?gid=2028782809&single=true&output=csv
    - **Unnamed: 0:** Unused column. This column is created when creating this sub-dataset.
    - **Id:** Id of the records.
    - **SepalLengthCm:** Sepal length of flowers in cm
    - **SepalWidthCm:** Sepal width of flowers in cm

- **Petal All:** https://docs.google.com/spreadsheets/d/e/2PACX-1vQinLXShrOz4ExNaW1bSQVuvbbhIzJW7G0kkkD2SvqSD6STjLrQQiftgI7BGe10sBZi0CNr2_sJpQAz/pub?gid=1580010789&single=true&output=csv
    - **Unnamed: 0:** Unused column. This column is created when creating this sub-dataset.
    - **Id:** Id of the records.
    - **PetalLengthCm:** Petal length of flowers in cm
    - **PetalWidthCm:** Petal width of flowers in cm

- **Iris Virginica:** https://docs.google.com/spreadsheets/d/e/2PACX-1vSK39MwduGPHYNgw5yViezoLYCVDKMCWIHzjnt3GZNaxHPFOQLr2q6no_tyqTsOk-VfXleslfGVe9eJ/pub?gid=314231613&single=true&output=csv
    - **Unnamed: 0:** Unused column. This column is created when creating the sub-dataset.
    - **Id:** Id of the records.
    - **Species:** Name of this species.

- **Iris Versicolor:** https://docs.google.com/spreadsheets/d/e/2PACX-1vTcSFgLnabqIrgIc5WlwvnbbvyyJsgZjR-0E0-4TR-5aHgv_0EP6yNWglkkls3AXM2qHCR5VYzWCoTM/pub?gid=715607857&single=true&output=csv
    - **Unnamed: 0:** Unused column. This column is created when creating the sub-dataset.
    - **Id:** Id of the records.
    - **Species:** Name of this species.

- **Iris Setosa:** https://docs.google.com/spreadsheets/d/e/2PACX-1vSjqJpdgy2X_oDUUqQ0sSaFKqnnf8MYU4KgJSYgHaHmq0Wb1weMOsJXh-rICHmkLcaTkOwzMYLeh959/pub?gid=2003684803&single=true&output=csv
    - **Unnamed 0:** Unused column. This column is created when creating the sub-dataset.
    - **Id:** Id of the records.
    - **Species:** Name of this species.

In [119]:
import pandas as pd
sepal_all = pd.read_csv("https://docs.google.com/spreadsheets/d/e/2PACX-1vT58ekmHTwptX7Bs4QOy6YByA1HMvYTACeeIjrKhHE0Pg1K_3egewHMKMh02zN9D5-yHVXfvuaa3s5u/pub?gid=2028782809&single=true&output=csv")
petal_all = pd.read_csv("https://docs.google.com/spreadsheets/d/e/2PACX-1vQinLXShrOz4ExNaW1bSQVuvbbhIzJW7G0kkkD2SvqSD6STjLrQQiftgI7BGe10sBZi0CNr2_sJpQAz/pub?gid=1580010789&single=true&output=csv")

virginica = pd.read_csv("https://docs.google.com/spreadsheets/d/e/2PACX-1vSK39MwduGPHYNgw5yViezoLYCVDKMCWIHzjnt3GZNaxHPFOQLr2q6no_tyqTsOk-VfXleslfGVe9eJ/pub?gid=314231613&single=true&output=csv")
versicolor = pd.read_csv("https://docs.google.com/spreadsheets/d/e/2PACX-1vTcSFgLnabqIrgIc5WlwvnbbvyyJsgZjR-0E0-4TR-5aHgv_0EP6yNWglkkls3AXM2qHCR5VYzWCoTM/pub?gid=715607857&single=true&output=csv")
setosa = pd.read_csv("https://docs.google.com/spreadsheets/d/e/2PACX-1vSjqJpdgy2X_oDUUqQ0sSaFKqnnf8MYU4KgJSYgHaHmq0Wb1weMOsJXh-rICHmkLcaTkOwzMYLeh959/pub?gid=2003684803&single=true&output=csv")

In [131]:
sepal_all.Id.unique()
# sepal_all.info()

array([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
        14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,  26,
        27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,  39,
        40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,  52,
        53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,  65,
        66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,  78,
        79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,  91,
        92,  93,  94,  95,  96,  97,  98,  99, 100, 101, 102, 103, 104,
       105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117,
       118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130,
       131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143,
       144, 145, 146, 147, 148, 149, 150], dtype=int64)

In [133]:
virginica.Id.unique()

array([101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113,
       114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126,
       127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139,
       140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150], dtype=int64)

### `Q-9:` Plot a bar chart of the average Sepal Length  of Virginica and average Petal length of Setosa flower.

In [ ]:
# code here

### `Q-10:` Create the complete dataset by uisng the below datasets:
- virginica
- versicolor
- setosa
- sepal all
- petal all

This dataset should have these below column names in order:
1. Id
2. Species
3. SepalLengthCm
4. SepalWidthCm
5. PetalLengthCm
6. PetalWidthCm

Also, the dataset should be shuffled means the `Id` column should not be in increasing or decreasing order. So, make a dataset which has the shuffled Id column. You can use `DataFrame.sample()` method to shuffle.

In [ ]:
# code here

### `Q-11:` Find out the maximum and minimum sepal width and petal width of Setosa and Versicolor. To do this:
- First create a dataset with merging the required datasets
- After that, use `groupby` to create groups based on the "Species" column.
- Then find out which are asked in this question.


The output should be like this:
```bash
Minimum Sepal width of Setosa is 2.3
Maximum Sepal width of Setosa is 4.4

**************************************************

Minimum Sepal width of Versicolor is 2.0
Maximum Sepal width of Versicolor is 3.4

**************************************************
```

In [ ]:
# code here